Revit 2027 API
AnalysisDisplayDeformedShapeSettings(AnalysisDisplayDeformedShapeSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings other
)
Public Sub New (
	other As AnalysisDisplayDeformedShapeSettings
)
public:
AnalysisDisplayDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings^ other
)
new :
        other : AnalysisDisplayDeformedShapeSettings -> AnalysisDisplayDeformedShapeSettings
Parameters
other AnalysisDisplayDeformedShapeSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayDeformedShapeSettings Class
AnalysisDisplayDeformedShapeSettings Overload
Autodesk.Revit.DB.Analysis Namespace